## Production: terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 20 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                   |
|--------|-------------------------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.daily_compliance_check`                      |
|        | `aws_cloudwatch_event_target.s3_csv_to_slack_target`                    |
|        | `aws_cloudwatch_log_group.s3_csv_to_slack_logs`                         |
|        | `aws_cloudwatch_metric_alarm.s3_csv_to_slack_duration`                  |
|        | `aws_cloudwatch_metric_alarm.s3_csv_to_slack_errors`                    |
|        | `aws_iam_policy.s3_csv_to_slack_s3_policy`                              |
|        | `aws_iam_role.s3_csv_to_slack_lambda_role`                              |
|        | `aws_iam_role_policy_attachment.admin`                                  |
|        | `aws_iam_role_policy_attachment.readonly`                               |
|        | `aws_iam_role_policy_attachment.s3_csv_to_slack_lambda_basic_execution` |
|        | `aws_iam_role_policy_attachment.s3_csv_to_slack_s3_policy_attachment`   |
|        | `aws_lambda_function.s3_csv_to_slack`                                   |
|        | `aws_lambda_permission.allow_eventbridge`                               |
|        | `aws_sns_topic.guardrails_alerts`                                       |
|        | `aws_sns_topic_policy.guardrails_alerts_policy`                         |
|        | `module.attach_tf_plan_policy.aws_iam_policy.this`                      |
|        | `module.attach_tf_plan_policy.aws_iam_role_policy_attachment.readonly`  |
|        | `module.attach_tf_plan_policy.aws_iam_role_policy_attachment.this`      |
|        | `module.gh_oidc_roles.aws_iam_role.this[&quot;gh_cac_report_apply_role&quot;]`    |
|        | `module.gh_oidc_roles.aws_iam_role.this[&quot;gh_cac_report_plan_role&quot;]`     |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/aws-guardrails-cac-solution/actions/runs/16761135277).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
20:57:05.034 STDOUT terraform:   + create
20:57:05.034 STDOUT terraform: Terraform will perform the following actions:
20:57:05.034 STDOUT terraform:   # aws_cloudwatch_event_rule.daily_compliance_check will be created
20:57:05.034 STDOUT terraform:   + resource "aws_cloudwatch_event_rule" "daily_compliance_check" {
20:57:05.034 STDOUT terraform:       + arn                 = (known after apply)
20:57:05.034 STDOUT terraform:       + description         = "Trigger S3 CSV to Slack Lambda daily at 5am PST"
20:57:05.034 STDOUT terraform:       + event_bus_name      = "default"
20:57:05.034 STDOUT terraform:       + force_destroy       = false
20:57:05.034 STDOUT terraform:       + id                  = (known after apply)
20:57:05.034 STDOUT terraform:       + name                = "guardrails-cac-daily-compliance-check"
20:57:05.034 STDOUT terraform:       + name_prefix         = (known after apply)
20:57:05.034 STDOUT terraform:       + schedule_expression = "cron(0 13 * * ? *)"
20:57:05.034 STDOUT terraform:       + tags                = {
20:57:05.034 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.034 STDOUT terraform:           + "Environment" = "prod"
20:57:05.034 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.034 STDOUT terraform:           + "Name"        = "Daily Compliance Check Schedule"
20:57:05.034 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.034 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.034 STDOUT terraform:         }
20:57:05.034 STDOUT terraform:       + tags_all            = {
20:57:05.034 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.034 STDOUT terraform:           + "Environment" = "prod"
20:57:05.034 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.034 STDOUT terraform:           + "Name"        = "Daily Compliance Check Schedule"
20:57:05.035 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.035 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.035 STDOUT terraform:         }
20:57:05.035 STDOUT terraform:     }
20:57:05.035 STDOUT terraform:   # aws_cloudwatch_event_target.s3_csv_to_slack_target will be created
20:57:05.035 STDOUT terraform:   + resource "aws_cloudwatch_event_target" "s3_csv_to_slack_target" {
20:57:05.035 STDOUT terraform:       + arn            = (known after apply)
20:57:05.035 STDOUT terraform:       + event_bus_name = "default"
20:57:05.035 STDOUT terraform:       + force_destroy  = false
20:57:05.035 STDOUT terraform:       + id             = (known after apply)
20:57:05.035 STDOUT terraform:       + input          = jsonencode(
20:57:05.035 STDOUT terraform:             {
20:57:05.035 STDOUT terraform:               + detail      = {
20:57:05.035 STDOUT terraform:                   + trigger = "daily-compliance-check"
20:57:05.035 STDOUT terraform:                 }
20:57:05.035 STDOUT terraform:               + detail-type = "Scheduled Event"
20:57:05.035 STDOUT terraform:               + source      = "eventbridge"
20:57:05.035 STDOUT terraform:             }
20:57:05.035 STDOUT terraform:         )
20:57:05.035 STDOUT terraform:       + rule           = "guardrails-cac-daily-compliance-check"
20:57:05.035 STDOUT terraform:       + target_id      = "S3CsvToSlackTarget"
20:57:05.035 STDOUT terraform:     }
20:57:05.035 STDOUT terraform:   # aws_cloudwatch_log_group.s3_csv_to_slack_logs will be created
20:57:05.035 STDOUT terraform:   + resource "aws_cloudwatch_log_group" "s3_csv_to_slack_logs" {
20:57:05.035 STDOUT terraform:       + arn               = (known after apply)
20:57:05.035 STDOUT terraform:       + id                = (known after apply)
20:57:05.035 STDOUT terraform:       + log_group_class   = (known after apply)
20:57:05.035 STDOUT terraform:       + name              = "/aws/lambda/guardrails-cac-s3-csv-to-slack"
20:57:05.035 STDOUT terraform:       + name_prefix       = (known after apply)
20:57:05.035 STDOUT terraform:       + retention_in_days = 14
20:57:05.035 STDOUT terraform:       + skip_destroy      = false
20:57:05.036 STDOUT terraform:       + tags              = {
20:57:05.036 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.036 STDOUT terraform:           + "Environment" = "prod"
20:57:05.036 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.036 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack Logs"
20:57:05.036 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.036 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.036 STDOUT terraform:         }
20:57:05.036 STDOUT terraform:       + tags_all          = {
20:57:05.036 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.036 STDOUT terraform:           + "Environment" = "prod"
20:57:05.036 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.036 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack Logs"
20:57:05.036 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.036 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.036 STDOUT terraform:         }
20:57:05.036 STDOUT terraform:     }
20:57:05.036 STDOUT terraform:   # aws_cloudwatch_metric_alarm.s3_csv_to_slack_duration will be created
20:57:05.036 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "s3_csv_to_slack_duration" {
20:57:05.036 STDOUT terraform:       + actions_enabled                       = true
20:57:05.036 STDOUT terraform:       + alarm_actions                         = (known after apply)
20:57:05.036 STDOUT terraform:       + alarm_description                     = "This metric monitors guardrails-cac-s3-csv-to-slack lambda duration"
20:57:05.036 STDOUT terraform:       + alarm_name                            = "guardrails-cac-s3-csv-to-slack-duration"
20:57:05.036 STDOUT terraform:       + arn                                   = (known after apply)
20:57:05.036 STDOUT terraform:       + comparison_operator                   = "GreaterThanThreshold"
20:57:05.036 STDOUT terraform:       + dimensions                            = {
20:57:05.036 STDOUT terraform:           + "FunctionName" = "guardrails-cac-s3-csv-to-slack"
20:57:05.037 STDOUT terraform:         }
20:57:05.037 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
20:57:05.037 STDOUT terraform:       + evaluation_periods                    = 2
20:57:05.037 STDOUT terraform:       + id                                    = (known after apply)
20:57:05.037 STDOUT terraform:       + metric_name                           = "Duration"
20:57:05.037 STDOUT terraform:       + namespace                             = "AWS/Lambda"
20:57:05.037 STDOUT terraform:       + ok_actions                            = (known after apply)
20:57:05.037 STDOUT terraform:       + period                                = 300
20:57:05.037 STDOUT terraform:       + statistic                             = "Average"
20:57:05.037 STDOUT terraform:       + tags                                  = {
20:57:05.037 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.037 STDOUT terraform:           + "Environment" = "prod"
20:57:05.037 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.037 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack Duration"
20:57:05.037 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.037 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.037 STDOUT terraform:         }
20:57:05.037 STDOUT terraform:       + tags_all                              = {
20:57:05.037 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.037 STDOUT terraform:           + "Environment" = "prod"
20:57:05.037 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.037 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack Duration"
20:57:05.037 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.037 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.037 STDOUT terraform:         }
20:57:05.037 STDOUT terraform:       + threshold                             = 240000
20:57:05.037 STDOUT terraform:       + treat_missing_data                    = "missing"
20:57:05.037 STDOUT terraform:     }
20:57:05.037 STDOUT terraform:   # aws_cloudwatch_metric_alarm.s3_csv_to_slack_errors will be created
20:57:05.037 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "s3_csv_to_slack_errors" {
20:57:05.037 STDOUT terraform:       + actions_enabled                       = true
20:57:05.037 STDOUT terraform:       + alarm_actions                         = (known after apply)
20:57:05.037 STDOUT terraform:       + alarm_description                     = "This metric monitors guardrails-cac-s3-csv-to-slack lambda errors"
20:57:05.037 STDOUT terraform:       + alarm_name                            = "guardrails-cac-s3-csv-to-slack-errors"
20:57:05.037 STDOUT terraform:       + arn                                   = (known after apply)
20:57:05.037 STDOUT terraform:       + comparison_operator                   = "GreaterThanThreshold"
20:57:05.037 STDOUT terraform:       + dimensions                            = {
20:57:05.038 STDOUT terraform:           + "FunctionName" = "guardrails-cac-s3-csv-to-slack"
20:57:05.038 STDOUT terraform:         }
20:57:05.038 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
20:57:05.038 STDOUT terraform:       + evaluation_periods                    = 2
20:57:05.038 STDOUT terraform:       + id                                    = (known after apply)
20:57:05.038 STDOUT terraform:       + metric_name                           = "Errors"
20:57:05.038 STDOUT terraform:       + namespace                             = "AWS/Lambda"
20:57:05.038 STDOUT terraform:       + ok_actions                            = (known after apply)
20:57:05.038 STDOUT terraform:       + period                                = 300
20:57:05.038 STDOUT terraform:       + statistic                             = "Sum"
20:57:05.038 STDOUT terraform:       + tags                                  = {
20:57:05.038 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.038 STDOUT terraform:           + "Environment" = "prod"
20:57:05.038 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.038 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack Errors"
20:57:05.038 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.038 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.038 STDOUT terraform:         }
20:57:05.038 STDOUT terraform:       + tags_all                              = {
20:57:05.038 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.038 STDOUT terraform:           + "Environment" = "prod"
20:57:05.038 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.038 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack Errors"
20:57:05.038 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.038 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.038 STDOUT terraform:         }
20:57:05.038 STDOUT terraform:       + threshold                             = 0
20:57:05.038 STDOUT terraform:       + treat_missing_data                    = "missing"
20:57:05.038 STDOUT terraform:     }
20:57:05.038 STDOUT terraform:   # aws_iam_policy.s3_csv_to_slack_s3_policy will be created
20:57:05.038 STDOUT terraform:   + resource "aws_iam_policy" "s3_csv_to_slack_s3_policy" {
20:57:05.038 STDOUT terraform:       + arn              = (known after apply)
20:57:05.038 STDOUT terraform:       + attachment_count = (known after apply)
20:57:05.038 STDOUT terraform:       + description      = "IAM policy for S3 access for the CSV to Slack Lambda function"
20:57:05.038 STDOUT terraform:       + id               = (known after apply)
20:57:05.038 STDOUT terraform:       + name             = "guardrails-cac-s3-csv-to-slack-s3-policy"
20:57:05.038 STDOUT terraform:       + name_prefix      = (known after apply)
20:57:05.038 STDOUT terraform:       + path             = "/"
20:57:05.038 STDOUT terraform:       + policy           = jsonencode(
20:57:05.038 STDOUT terraform:             {
20:57:05.038 STDOUT terraform:               + Statement = [
20:57:05.038 STDOUT terraform:                   + {
20:57:05.038 STDOUT terraform:                       + Action   = [
20:57:05.038 STDOUT terraform:                           + "s3:GetObject",
20:57:05.038 STDOUT terraform:                           + "s3:ListBucket",
20:57:05.038 STDOUT terraform:                         ]
20:57:05.038 STDOUT terraform:                       + Effect   = "Allow"
20:57:05.038 STDOUT terraform:                       + Resource = [
20:57:05.038 STDOUT terraform:                           + "arn:aws:s3:::gc-fedclient-886481071419-ca-central-1",
20:57:05.038 STDOUT terraform:                           + "arn:aws:s3:::gc-fedclient-886481071419-ca-central-1/*",
20:57:05.038 STDOUT terraform:                         ]
20:57:05.038 STDOUT terraform:                     },
20:57:05.038 STDOUT terraform:                 ]
20:57:05.038 STDOUT terraform:               + Version   = "2012-10-17"
20:57:05.038 STDOUT terraform:             }
20:57:05.039 STDOUT terraform:         )
20:57:05.039 STDOUT terraform:       + policy_id        = (known after apply)
20:57:05.039 STDOUT terraform:       + tags             = {
20:57:05.039 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.039 STDOUT terraform:           + "Environment" = "prod"
20:57:05.039 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.039 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack S3 Policy"
20:57:05.039 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.039 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.039 STDOUT terraform:         }
20:57:05.039 STDOUT terraform:       + tags_all         = {
20:57:05.039 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.039 STDOUT terraform:           + "Environment" = "prod"
20:57:05.039 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.039 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack S3 Policy"
20:57:05.039 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.039 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.039 STDOUT terraform:         }
20:57:05.039 STDOUT terraform:     }
20:57:05.039 STDOUT terraform:   # aws_iam_role.s3_csv_to_slack_lambda_role will be created
20:57:05.039 STDOUT terraform:   + resource "aws_iam_role" "s3_csv_to_slack_lambda_role" {
20:57:05.039 STDOUT terraform:       + arn                   = (known after apply)
20:57:05.039 STDOUT terraform:       + assume_role_policy    = jsonencode(
20:57:05.039 STDOUT terraform:             {
20:57:05.039 STDOUT terraform:               + Statement = [
20:57:05.039 STDOUT terraform:                   + {
20:57:05.039 STDOUT terraform:                       + Action    = "sts:AssumeRole"
20:57:05.039 STDOUT terraform:                       + Effect    = "Allow"
20:57:05.039 STDOUT terraform:                       + Principal = {
20:57:05.039 STDOUT terraform:                           + Service = "lambda.amazonaws.com"
20:57:05.039 STDOUT terraform:                         }
20:57:05.039 STDOUT terraform:                     },
20:57:05.039 STDOUT terraform:                 ]
20:57:05.039 STDOUT terraform:               + Version   = "2012-10-17"
20:57:05.039 STDOUT terraform:             }
20:57:05.039 STDOUT terraform:         )
20:57:05.039 STDOUT terraform:       + create_date           = (known after apply)
20:57:05.039 STDOUT terraform:       + force_detach_policies = false
20:57:05.039 STDOUT terraform:       + id                    = (known after apply)
20:57:05.039 STDOUT terraform:       + managed_policy_arns   = (known after apply)
20:57:05.039 STDOUT terraform:       + max_session_duration  = 3600
20:57:05.039 STDOUT terraform:       + name                  = "guardrails-cac-s3-csv-to-slack-role"
20:57:05.039 STDOUT terraform:       + name_prefix           = (known after apply)
20:57:05.039 STDOUT terraform:       + path                  = "/"
20:57:05.039 STDOUT terraform:       + tags                  = {
20:57:05.039 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.039 STDOUT terraform:           + "Environment" = "prod"
20:57:05.039 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.039 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack Role"
20:57:05.039 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.039 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.039 STDOUT terraform:         }
20:57:05.039 STDOUT terraform:       + tags_all              = {
20:57:05.039 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.039 STDOUT terraform:           + "Environment" = "prod"
20:57:05.039 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.039 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack Role"
20:57:05.039 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.039 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.039 STDOUT terraform:         }
20:57:05.039 STDOUT terraform:       + unique_id             = (known after apply)
20:57:05.039 STDOUT terraform:       + inline_policy (known after apply)
20:57:05.039 STDOUT terraform:     }
20:57:05.039 STDOUT terraform:   # aws_iam_role_policy_attachment.admin will be created
20:57:05.040 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "admin" {
20:57:05.040 STDOUT terraform:       + id         = (known after apply)
20:57:05.040 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
20:57:05.040 STDOUT terraform:       + role       = "gh_cac_report_apply_role"
20:57:05.040 STDOUT terraform:     }
20:57:05.040 STDOUT terraform:   # aws_iam_role_policy_attachment.readonly will be created
20:57:05.040 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "readonly" {
20:57:05.040 STDOUT terraform:       + id         = (known after apply)
20:57:05.040 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
20:57:05.040 STDOUT terraform:       + role       = "gh_cac_report_plan_role"
20:57:05.040 STDOUT terraform:     }
20:57:05.040 STDOUT terraform:   # aws_iam_role_policy_attachment.s3_csv_to_slack_lambda_basic_execution will be created
20:57:05.040 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "s3_csv_to_slack_lambda_basic_execution" {
20:57:05.040 STDOUT terraform:       + id         = (known after apply)
20:57:05.040 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
20:57:05.040 STDOUT terraform:       + role       = "guardrails-cac-s3-csv-to-slack-role"
20:57:05.040 STDOUT terraform:     }
20:57:05.040 STDOUT terraform:   # aws_iam_role_policy_attachment.s3_csv_to_slack_s3_policy_attachment will be created
20:57:05.040 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "s3_csv_to_slack_s3_policy_attachment" {
20:57:05.040 STDOUT terraform:       + id         = (known after apply)
20:57:05.040 STDOUT terraform:       + policy_arn = (known after apply)
20:57:05.040 STDOUT terraform:       + role       = "guardrails-cac-s3-csv-to-slack-role"
20:57:05.040 STDOUT terraform:     }
20:57:05.040 STDOUT terraform:   # aws_lambda_function.s3_csv_to_slack will be created
20:57:05.040 STDOUT terraform:   + resource "aws_lambda_function" "s3_csv_to_slack" {
20:57:05.040 STDOUT terraform:       + architectures                  = (known after apply)
20:57:05.040 STDOUT terraform:       + arn                            = (known after apply)
20:57:05.040 STDOUT terraform:       + code_sha256                    = (known after apply)
20:57:05.040 STDOUT terraform:       + filename                       = "./s3_csv_to_slack.zip"
20:57:05.040 STDOUT terraform:       + function_name                  = "guardrails-cac-s3-csv-to-slack"
20:57:05.040 STDOUT terraform:       + handler                        = "app.lambda_handler"
20:57:05.040 STDOUT terraform:       + id                             = (known after apply)
20:57:05.040 STDOUT terraform:       + invoke_arn                     = (known after apply)
20:57:05.040 STDOUT terraform:       + last_modified                  = (known after apply)
20:57:05.040 STDOUT terraform:       + layers                         = [
20:57:05.040 STDOUT terraform:           + "arn:aws:lambda:ca-central-1:886481071419:layer:CloudGuardrailsCommonLayerPartEvidenceCollection:4",
20:57:05.040 STDOUT terraform:         ]
20:57:05.040 STDOUT terraform:       + memory_size                    = 512
20:57:05.040 STDOUT terraform:       + package_type                   = "Zip"
20:57:05.040 STDOUT terraform:       + publish                        = false
20:57:05.040 STDOUT terraform:       + qualified_arn                  = (known after apply)
20:57:05.040 STDOUT terraform:       + qualified_invoke_arn           = (known after apply)
20:57:05.040 STDOUT terraform:       + reserved_concurrent_executions = -1
20:57:05.040 STDOUT terraform:       + role                           = (known after apply)
20:57:05.040 STDOUT terraform:       + runtime                        = "python3.12"
20:57:05.040 STDOUT terraform:       + signing_job_arn                = (known after apply)
20:57:05.040 STDOUT terraform:       + signing_profile_version_arn    = (known after apply)
20:57:05.040 STDOUT terraform:       + skip_destroy                   = false
20:57:05.040 STDOUT terraform:       + source_code_hash               = "EF4+lYVh8tTsaxWypXfsgcvF07K49bcyQoi+RS3/k8w="
20:57:05.041 STDOUT terraform:       + source_code_size               = (known after apply)
20:57:05.041 STDOUT terraform:       + tags                           = {
20:57:05.041 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.041 STDOUT terraform:           + "Environment" = "prod"
20:57:05.041 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.041 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack"
20:57:05.041 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.041 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.041 STDOUT terraform:         }
20:57:05.041 STDOUT terraform:       + tags_all                       = {
20:57:05.041 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.041 STDOUT terraform:           + "Environment" = "prod"
20:57:05.041 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.041 STDOUT terraform:           + "Name"        = "guardrails-cac-s3-csv-to-slack"
20:57:05.041 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.041 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.041 STDOUT terraform:         }
20:57:05.041 STDOUT terraform:       + timeout                        = 300
20:57:05.041 STDOUT terraform:       + version                        = (known after apply)
20:57:05.041 STDOUT terraform:       + environment {
20:57:05.041 STDOUT terraform:           + variables = {
20:57:05.041 STDOUT terraform:               + "S3_BUCKET"         = "gc-fedclient-886481071419-ca-central-1"
20:57:05.041 STDOUT terraform:               + "SLACK_WEBHOOK_URL" = (sensitive value)
20:57:05.041 STDOUT terraform:             }
20:57:05.041 STDOUT terraform:         }
20:57:05.041 STDOUT terraform:       + ephemeral_storage (known after apply)
20:57:05.041 STDOUT terraform:       + logging_config (known after apply)
20:57:05.041 STDOUT terraform:       + tracing_config (known after apply)
20:57:05.041 STDOUT terraform:     }
20:57:05.041 STDOUT terraform:   # aws_lambda_permission.allow_eventbridge will be created
20:57:05.041 STDOUT terraform:   + resource "aws_lambda_permission" "allow_eventbridge" {
20:57:05.041 STDOUT terraform:       + action              = "lambda:InvokeFunction"
20:57:05.041 STDOUT terraform:       + function_name       = "guardrails-cac-s3-csv-to-slack"
20:57:05.041 STDOUT terraform:       + id                  = (known after apply)
20:57:05.041 STDOUT terraform:       + principal           = "events.amazonaws.com"
20:57:05.041 STDOUT terraform:       + source_arn          = (known after apply)
20:57:05.041 STDOUT terraform:       + statement_id        = "AllowExecutionFromEventBridge"
20:57:05.041 STDOUT terraform:       + statement_id_prefix = (known after apply)
20:57:05.041 STDOUT terraform:     }
20:57:05.041 STDOUT terraform:   # aws_sns_topic.guardrails_alerts will be created
20:57:05.041 STDOUT terraform:   + resource "aws_sns_topic" "guardrails_alerts" {
20:57:05.041 STDOUT terraform:       + arn                         = (known after apply)
20:57:05.041 STDOUT terraform:       + beginning_archive_time      = (known after apply)
20:57:05.041 STDOUT terraform:       + content_based_deduplication = false
20:57:05.041 STDOUT terraform:       + delivery_policy             = jsonencode(
20:57:05.041 STDOUT terraform:             {
20:57:05.041 STDOUT terraform:               + http = {
20:57:05.041 STDOUT terraform:                   + defaultHealthyRetryPolicy    = {
20:57:05.041 STDOUT terraform:                       + backoffFunction    = "linear"
20:57:05.041 STDOUT terraform:                       + maxDelayTarget     = 20
20:57:05.041 STDOUT terraform:                       + minDelayTarget     = 20
20:57:05.041 STDOUT terraform:                       + numMaxDelayRetries = 0
20:57:05.041 STDOUT terraform:                       + numMinDelayRetries = 0
20:57:05.041 STDOUT terraform:                       + numNoDelayRetries  = 0
20:57:05.041 STDOUT terraform:                       + numRetries         = 3
20:57:05.041 STDOUT terraform:                     }
20:57:05.042 STDOUT terraform:                   + defaultThrottlePolicy        = {
20:57:05.042 STDOUT terraform:                       + maxReceivesPerSecond = 1
20:57:05.042 STDOUT terraform:                     }
20:57:05.042 STDOUT terraform:                   + disableSubscriptionOverrides = false
20:57:05.042 STDOUT terraform:                 }
20:57:05.042 STDOUT terraform:             }
20:57:05.042 STDOUT terraform:         )
20:57:05.042 STDOUT terraform:       + display_name                = "AWS Guardrails CAC Solution Alerts"
20:57:05.042 STDOUT terraform:       + fifo_throughput_scope       = (known after apply)
20:57:05.042 STDOUT terraform:       + fifo_topic                  = false
20:57:05.042 STDOUT terraform:       + id                          = (known after apply)
20:57:05.042 STDOUT terraform:       + kms_master_key_id           = "alias/aws/sns"
20:57:05.042 STDOUT terraform:       + name                        = "guardrails-cac-alerts"
20:57:05.042 STDOUT terraform:       + name_prefix                 = (known after apply)
20:57:05.042 STDOUT terraform:       + owner                       = (known after apply)
20:57:05.042 STDOUT terraform:       + policy                      = (known after apply)
20:57:05.042 STDOUT terraform:       + signature_version           = (known after apply)
20:57:05.042 STDOUT terraform:       + tags                        = {
20:57:05.042 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.042 STDOUT terraform:           + "Environment" = "prod"
20:57:05.042 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.042 STDOUT terraform:           + "Name"        = "guardrails-cac Alerts Topic"
20:57:05.042 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.042 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.042 STDOUT terraform:           + "Type"        = "notification"
20:57:05.042 STDOUT terraform:         }
20:57:05.042 STDOUT terraform:       + tags_all                    = {
20:57:05.042 STDOUT terraform:           + "CostCenter"  = "guardrails"
20:57:05.042 STDOUT terraform:           + "Environment" = "prod"
20:57:05.042 STDOUT terraform:           + "ManagedBy"   = "terraform"
20:57:05.042 STDOUT terraform:           + "Name"        = "guardrails-cac Alerts Topic"
20:57:05.042 STDOUT terraform:           + "Owner"       = "sre-team"
20:57:05.042 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
20:57:05.042 STDOUT terraform:           + "Type"        = "notification"
20:57:05.042 STDOUT terraform:         }
20:57:05.042 STDOUT terraform:       + tracing_config              = (known after apply)
20:57:05.042 STDOUT terraform:     }
20:57:05.042 STDOUT terraform:   # aws_sns_topic_policy.guardrails_alerts_policy will be created
20:57:05.042 STDOUT terraform:   + resource "aws_sns_topic_policy" "guardrails_alerts_policy" {
20:57:05.042 STDOUT terraform:       + arn    = (known after apply)
20:57:05.042 STDOUT terraform:       + id     = (known after apply)
20:57:05.042 STDOUT terraform:       + owner  = (known after apply)
20:57:05.042 STDOUT terraform:       + policy = (known after apply)
20:57:05.042 STDOUT terraform:     }
20:57:05.042 STDOUT terraform:   # module.attach_tf_plan_policy.aws_iam_policy.this will be created
20:57:05.042 STDOUT terraform:   + resource "aws_iam_policy"...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.daily_compliance_check"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.s3_csv_to_slack_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.s3_csv_to_slack_duration"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.s3_csv_to_slack_errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.s3_csv_to_slack_s3_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.s3_csv_to_slack_lambda_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.s3_csv_to_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.guardrails_alerts"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
